'use strict'
/**
 * Последнее значение цикла
Какое последнее значение выведет этот код? Почему?
*/
function lastNumber(){
  let i = 3;
  while (i) {       // last one will be 1
    alert( i-- );
  }
}

/**
 * Какие значения выведет цикл while?
Для каждого цикла запишите, какие значения он выведет. Потом сравните с ответом.
Оба цикла выводят alert с одинаковыми значениями или нет?
*/

// Префиксный вариант ++i:
// alerts i from 1 to 4
function prefix(){
  let i = 0;
  while (++i < 5) console.log( i );
}

// Постфиксный вариант i++
// alerts j from 1 to 5
function postfix(){
  let j = 0;
  while (j++ < 5) console.log( j );
}

/**
 * Выведите чётные числа
При помощи цикла for выведите чётные числа от 2 до 10.
 */
function getEven(){
  for(let i = 1; i < 11; i++){
    if (i % 2 === 0) console.log(i)
  }
}

/**
 * Замените for на while
Перепишите код, заменив цикл for на while, без изменения поведения цикла
 
for (let i = 0; i < 3; i++) {
  alert( `number ${i}!` );
}
*/
function replaceWhile(){
  let i = 0;
  while(i < 3){
    console.log( `number ${i}!` );
    i++
  }
}

/**
 * Повторять цикл, пока ввод неверен
Напишите цикл, который предлагает prompt ввести число, большее 100. Если посетитель ввёл другое число – попросить ввести ещё раз, и так далее.

Цикл должен спрашивать число пока либо посетитель не введёт число, большее 100, либо не нажмёт кнопку Отмена (ESC).

Предполагается, что посетитель вводит только числа. Предусматривать обработку нечисловых строк в этой задаче необязательно.
 */
function guessNumber(){
  let answer = 0;
  while(answer < 101 && answer !== null){
    answer = prompt('put number bigger then 100')
  }
}

/**
 * Вывести простые числа
Натуральное число, большее 1, называется простым, если оно ни на что не делится, кроме себя и 1.

Другими словами, n > 1 – простое, если при его делении на любое число кроме 1 и n есть остаток.

Например, 5 это простое число, оно не может быть разделено без остатка на 2, 3 и 4.

Напишите код, который выводит все простые числа из интервала от 2 до n.

Для n = 10 результат должен быть 2,3,5,7.

P.S. Код также должен легко модифицироваться для любых других интервалов.
 */
function isSimpleNumber(num){
  start:
  for(let i = 2; i <= num; i++){
    for(let j = 2; j < i; j++){
      if (i % j === 0) {
        console.log(i, 'is compl')
        continue start
      }
    }
    console.log(i, 'is simple')
  }
}